In [1]:
import pandas as pd
import numpy as np

In [6]:
dates = pd.date_range("20250424", periods=5)
dates

DatetimeIndex(['2025-04-24', '2025-04-25', '2025-04-26', '2025-04-27',
               '2025-04-28'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(5, 5), index=dates, columns=list("ABCDE"))
df.head(5)

                   A         B         C         D         E
2025-04-24  1.365968  1.588631  0.169827 -1.155505 -0.442843
2025-04-25  1.317337 -0.007610 -0.495680 -0.288309  0.230458
2025-04-26 -1.027974  1.383081 -0.425933 -0.336326  1.161074
2025-04-27  1.578615  0.641706  1.896433 -0.033084  0.463517
2025-04-28 -1.235079  0.739583  0.253437  0.770598  2.112477

In [11]:
df["A"]

2025-04-24    1.365968
2025-04-25    1.317337
2025-04-26   -1.027974
2025-04-27    1.578615
2025-04-28   -1.235079
Freq: D, Name: A, dtype: float64

In [14]:
df[0:5:2]

                   A         B         C         D         E
2025-04-24  1.365968  1.588631  0.169827 -1.155505 -0.442843
2025-04-26 -1.027974  1.383081 -0.425933 -0.336326  1.161074
2025-04-28 -1.235079  0.739583  0.253437  0.770598  2.112477

In [22]:
df.loc[dates[:2]]

                   A         B         C         D         E
2025-04-24  1.365968  1.588631  0.169827 -1.155505 -0.442843
2025-04-25  1.317337 -0.007610 -0.495680 -0.288309  0.230458

In [27]:
df.at[dates[2], 'A']

-1.027973676411673

In [30]:
df.loc[[True, True, False, True, False]]

                   A         B         C         D         E
2025-04-24  1.365968  1.588631  0.169827 -1.155505 -0.442843
2025-04-25  1.317337 -0.007610 -0.495680 -0.288309  0.230458
2025-04-27  1.578615  0.641706  1.896433 -0.033084  0.463517

In [34]:
df.loc[dates[0]] > 0

A     True
B     True
C     True
D    False
E    False
Name: 2025-04-24 00:00:00, dtype: bool

In [35]:
df[df > 0]

                   A         B         C         D         E
2025-04-24  1.365968  1.588631  0.169827       NaN       NaN
2025-04-25  1.317337       NaN       NaN       NaN  0.230458
2025-04-26       NaN  1.383081       NaN       NaN  1.161074
2025-04-27  1.578615  0.641706  1.896433       NaN  0.463517
2025-04-28       NaN  0.739583  0.253437  0.770598  2.112477

In [41]:
s1 = pd.Series([1, 2, 3, 4, 5], index=pd.date_range("20130102", periods=5))

In [42]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
Freq: D, dtype: int64

In [43]:
df["F"] = s1

In [45]:
df.at[dates[0], "A"]

1.365968192700951

In [47]:
df.iat[0, 1] = 0

In [51]:
df.loc[:, "D"] = np.array([5] * len(df))

In [55]:
df1 = df.reindex(index = dates[:3], columns=list(df.columns) + ['G'])

In [56]:
df1

                   A         B         C    D         E   F   G
2025-04-24  1.365968  0.000000  0.169827  5.0 -0.442843 NaN NaN
2025-04-25  1.317337 -0.007610 -0.495680  5.0  0.230458 NaN NaN
2025-04-26 -1.027974  1.383081 -0.425933  5.0  1.161074 NaN NaN

In [58]:
df1.loc[dates[0]:dates[1], 'F'] = 1

In [59]:
df1

                   A         B         C    D         E    F   G
2025-04-24  1.365968  0.000000  0.169827  5.0 -0.442843  1.0 NaN
2025-04-25  1.317337 -0.007610 -0.495680  5.0  0.230458  1.0 NaN
2025-04-26 -1.027974  1.383081 -0.425933  5.0  1.161074  NaN NaN

In [61]:
df1.dropna()

Empty DataFrame
Columns: [A, B, C, D, E, F, G]
Index: []

In [65]:
df1.fillna(value=100)

                   A         B         C    D         E      F      G
2025-04-24  1.365968  0.000000  0.169827  5.0 -0.442843    1.0  100.0
2025-04-25  1.317337 -0.007610 -0.495680  5.0  0.230458    1.0  100.0
2025-04-26 -1.027974  1.383081 -0.425933  5.0  1.161074  100.0  100.0

In [67]:
df = pd.DataFrame(
     {
         "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
         "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
         "C": np.random.randn(8),
         "D": np.random.randn(8),
     }
 )
df

     A      B         C         D
0  foo    one -0.190977 -1.801916
1  bar    one  1.066620  1.529692
2  foo    two -0.217175  0.330810
3  bar  three -1.619344  0.957019
4  foo    two  2.444394 -0.590889
5  bar    two  0.516670  0.282633
6  foo    one  2.075825  0.783150
7  foo  three -0.724860 -0.508093

In [81]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    1.066620  1.529692
    three -1.619344  0.957019
    two    0.516670  0.282633
foo one    1.884847 -1.018766
    three -0.724860 -0.508093
    two    2.227219 -0.260078